# GetTypeList Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..GetTypeList Method
IFCData Class See Also
---
Gets the multiple strings represent one IFC type name.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<string> GetTypeList()
```

Visual Basic
---
```text
Public Function GetTypeList As IList(Of String)
```

Visual C++
---
```text
public:
IList<String^>^ GetTypeList()
```

# ### Return Value
The strings.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | No type assigned or it is a simple type. |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace